package com.example.bjimba.diabeteshelper;

import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.widget.TextView;

public class Main5Activity extends AppCompatActivity {
    TextView main41Text1,main42Text2;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main5);

        main41Text1= (TextView) findViewById(R.id.main4Text1);
        main42Text2= (TextView) findViewById(R.id.main4Text2);

        main41Text1.setText("मधुमेह: शारीरिक व्यायाम");
        main42Text2.setText("शारीरिक व्यायामका फाइदाहरु:\n" +
                "तौल नियन्त्रण गर्ने \n" +
                "मधुमेहको खतरा घटाउने \n" +
                "मुटुको रोग हुने खतरा घटाउने\n" +
                "रगतमा लिपिड र उच्च रक्तचाप नियन्त्रण गर्ने \n" +
                "मानसिक तनाव कम गर्ने \n" +
                "मांसपेशी र हड्डी बलियो बनाउने \n" +
                "\n" +
                "शारीरिक व्यायामको योजना:\n" +
                "•\tशारीरिक व्यायाम सुरु गर्नुपूर्व चिकित्सकको सल्लाह लिने \n" +
                "•\tशारीरिक व्यायाम शारीरिक र मानसिक अवस्थामा भर पर्छ | सुरुमा सजिलो ब्यायाम बाट सुरुगरि बिस्तारै बढाउदै जाने \n" +
                "•\tबिहान हिड्ने बानी बसाल्ने \n" +
                "•\tकम्तिमा हप्तामा ५ दिन शारीरिक व्यायाम गर्ने र दिनमा कम्तिमा ३० मिनेट गर्नुपर्छ \n" +
                "•\tशारीरिक व्यायाम सुरु गर्नु भन्दा अगाडी ५-१० मिनेट शरिर न्यानो बनाउने र हलुका कसरत गर्ने वा तानिने \n" +
                "•\tकसरत सुरु गर्नु भन्दा पहिले र बीच बीचमा प्रशस्त पानी पिउने \n" +
                "•\tकसरत गरिरहेको बेला असजिलो महशुस (जस्तै: छाती दुख्ने, धेरै थाकेको वा दम ) भएमा तुरुन्त रोक्ने र पुनः कसरत सुरु गर्नु भन्दा पहिले चिकित्सकको सल्लाह लिनुपर्छ \n" +
                "ब्यायाम गर्दा अपनाउनु पर्ने सावधानीहरु :\n" +
                "•\tपैदल हिड्नु पुर्व र हिडेर आएपछि हरेक पटक खुट्टाको जांच गर्ने \n" +
                "•\tब्यायाम गर्न जानु पुर्व कुनै धारिलो बस्तुहरु छ कि भनेर जुत्ता राम्रो संग जांच गर्ने \n" +
                "•\tखुट्टा को आकार अनुसारको जुत्ता लगाउने र नयाँ जुत्ता लगाएर केहि समय सम्म लामो दूरी पैदल यात्रा नगर्ने \n" +
                "•\tउन वा सुति कपडा बाट बनेको सफा मोजा लगाउने  \n" +
                "ब्यायाम गर्न जाने बेला स्वास्थ्य जाँच गरेको कार्ड संगै राख्ने जसले गर्दा बिरामी पर्दा वा स्वास्थ्य अवस्था बिग्रिदा नजिक भएको व्यक्तिले सहयोग गर्न सक्छ\n");
    }
}
