package com.example.bjimba.diabeteshelper;

import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.widget.TextView;

public class Main3Activity extends AppCompatActivity {


    TextView main1Text1,main2Text2;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main3);

        main1Text1= (TextView) findViewById(R.id.main2Text1);
        main2Text2= (TextView) findViewById(R.id.main2Text2);

        main1Text1.setText("मधुमेह: औषधी ब्यवस्थापन");
        main2Text2.setText("•\tचिकित्सकको सल्लाह अनुसार  मात्र औषधी सेवन गर्नु पर्दछ र  औषधी सेवन गर्दा निम्न कुराहरुमा ध्यान दिनुपर्छ :\n" +
                "•\tऔषधीको मात्रा \n" +
                "•\tऔषधीको पटक \n" +
                "•\tऔषधी सम्बन्धि जानकारी \n" +
                "•\tऔषधी कहिले सम्म खाने \n" +
                "•\tऔषधी किन्ने बेला औषधीको म्याद हेरेर मात्र किन्नु पर्दछ \n" +
                "•\tसहि तरिकाले इन्सुलिन स्टोर र लगाउन सिक्ने  \n" +
                "\n" +
                "यदि चिकित्सकले इन्सुलिन प्रयोग गर्न सल्लाह दिएको छ भने सहि तरिकाले इन्सुलिन लगाउन र स्टोर गर्न तपशिलका तरिकाहरु अनुसरण गर्नुपर्दछ \n" +
                "\n" +
                "<br>इन्सुलिन लगाउन र स्टोर गर्ने तरिकाहरु :</br>\n" +
                "•\tसर्वप्रथम इन्सुलिनको बोतलको ढक्कन जाँच गर्ने र औषधीको समाप्त हुने म्याद जाँच गर्ने\n" +
                "•\tइन्सुलिनको इकाई प्रति मिलिलिटरमा  ४० इकाई अथवा १०० इकाई ध्यान पुर्वक  पढ्ने | त्यसै अनुसार इन्सुलिन सुई प्रयोग गर्ने | ४० इकाई इन्सुलिनको लागि ४० इकाई भएको सुई र  १०० इकाई इन्सुलिनको लागि१०० इकाई भएको सुई प्रयोग गर्नु पर्दछ | \n" +
                "•\tइन्सुलिन सुई लगाउन आवश्यक सामग्री सजिलै संग भेट्ने स्थानमा राख्ने \n" +
                "•\tइन्सुलिन सुई लगाउनु पुर्व साबुन पानीले हात धुने \n" +
                "•\tइन्सुलिनलाई मिश्रण गर्न बिस्तारै दुवै हातको हत्केलामा घुमाउने तर धेरै जोडले हल्लाउनु हुदैन \n" +
                "•\tइन्सुलिनको शिशी माथिको रबरको बिर्कोलाई स्प्रिटले सफा गरि हावामा सुख्खा हुन दिने \n" +
                "•\tचिकित्सकको सल्लाह अनुसार आवश्यक इन्सुलिनको मात्रा सुईमा भर्ने \n" +
                "•\tइन्सुलिनको शिशी माथिको  रबरको बिर्को छेडेर सुईमा इन्सुलिनको मात्रा भर्ने र सुइको टुप्पो (निडिल) नछुने र सुई भित्रको हावा शिशी भित्रै मिलाउने \n" +
                "•\tसुई लगाउने ठाउँ स्प्रिटले सफा गर्ने र सुख्खा हुन दिने \n" +
                "•\tसुइको निडिल ४५ देखि ९० डिग्रीको कोण बनाएर छालालाई अलि उठाएर छिटो बित्र पसाउने र पिस्टन धकेल्ने \n" +
                "•\tइन्सुलिनको पुरा मात्र शरिरमा पठाई सकेपछि बिस्तारै सुईलाई बाहिर निकाल्ने \n" +
                "\n" +

                "इन्सुलिन लगाउने सकिने स्थान हरु:\n" +
                "•\tदुबै माथिल्लो पाखुराको बाहिरी भागमा \n" +
                "•\tपेट \n" +
                "•\tदुबै जांघको अगाडी र छेउको भाग \n" +
                "•\tपुठ्ठा / चाकको माथिल्लो भाग \n" +
                "दैनिक एउटै स्थानमा सुई लगाउनु हुदैन| दुई हप्ता भित्रमा दुई पटक एउटै स्थानमा सुई नलाग्ने गरि योजना बनाउनु पर्दछ |\n");
    }
}
